tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "ngrok/ngrok"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Persistent key-value database, with built-in net interface
brew "redis"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Terraform
brew "hashicorp/tap/terraform"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@4.2"
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Control your tools with a few keystrokes
cask "raycast"
# Multimedia player
cask "vlc"
