tap "adoptopenjdk/openjdk"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jarred-sumner/git-peek"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "powershell/tap"
tap "weaveworks/tap"
brew "webp"
brew "jpeg-xl"
brew "pycparser"
brew "cffi"
brew "awscli"
brew "binutils"
brew "boost"
brew "broot"
brew "gettext"
brew "glib"
brew "ccache"
brew "cmake"
brew "coreutils"
brew "harfbuzz"
brew "derby"
brew "dive"
brew "docutils"
brew "doxygen"
brew "duckdb"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "libtool"
brew "erlang"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "openjpeg"
brew "leptonica"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "libassuan"
brew "gnupg"
brew "gnuplot"
brew "go"
brew "grep"
brew "guile"
brew "httpie"
brew "k6"
brew "kind"
brew "kubernetes-cli"
brew "libffi"
brew "libzip"
brew "llvm"
brew "llvm@14"
brew "minikube"
brew "node"
brew "mongosh"
brew "nasm"
brew "neovim"
brew "ninja"
brew "nmap"
brew "nvm"
brew "pandoc"
brew "parquet-cli"
brew "pinentry-mac"
brew "poppler"
brew "protobuf"
brew "python@3.10"
brew "python@3.11"
brew "pywhat"
brew "scc"
brew "sqlc"
brew "swig"
brew "tldr"
brew "tokei"
brew "trash", link: true
brew "tree"
brew "uv"
brew "watchman"
brew "wget"
brew "zoxide"
brew "hashicorp/tap/terraform"
brew "mongodb/brew/mongodb-database-tools"
brew "oven-sh/bun/bun"
brew "weaveworks/tap/eksctl"
cask "adobe-acrobat-reader"
cask "adoptopenjdk8"
cask "cursor"
cask "docker-desktop"
cask "iterm2"
cask "medis"
cask "mitmproxy"
cask "mongodb-compass"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "postman"
cask "raycast"
cask "slack"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "atelierbram.atelier-vscode-themes"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "bradymholt.pgformatter"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.github-vscode-theme"
vscode "gleam.gleam"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "jakebecker.elixir-ls"
vscode "justusadam.language-haskell"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "pomber.git-file-history"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.vscode-yaml"
vscode "redocly.openapi-vs-code"
vscode "rust-lang.rust-analyzer"
vscode "t3dotgg.vsc-material-theme-but-i-wont-sue-you"
vscode "timonwong.shellcheck"
vscode "vadimcn.vscode-lldb"
vscode "vsls-contrib.gistfs"
vscode "xaver.clang-format"
vscode "zxh404.vscode-proto3"
